module.exports = {
  // Количество символов в строке
  printWidth: 100,
  // Количество пробелов для вложенности
  tabWidth: 2,
  // Использование табов
  useTabs: false,
  // Использование точки с запятой в конце операторов
  semi: true,
  // Использование одинарных ковычек вместо двойных
  singleQuote: true,
  // Если хотя бы одно свойство в объекте требует кавычек, заключить в кавычки все свойства
  quoteProps: 'consistent',
  // Не использовать одинарные ковычки в JSX
  jsxSingleQuote: false,
  // Конечные запятые везде, где они возможны и действительны в ES5
  trailingComma: 'es5',
  // Пробелы между фигурными скобками
  bracketSpacing: true,
  // Закрытие многострочного JSX элемента на отдельной строке
  jsxBracketSameLine: false,
  // Опустить скобки для стрелочной функции с одним параметром
  arrowParens: 'avoid',
};
